<?php

namespace Database\Seeders;

use App\Models\Book;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    { //
        /* {
             $books = [
                 //novels
                 [
                     'title' => 'قواعد جارتين',
                     'file' => 'books/files/قواعد جارتين.pdf',
                     'cover' => 'books/cover_images/قواعد جارتين.jpg',
                     'author_name' => 'عمرو عبد الحميد',
                     'points' => 0,
                     'description' => 'ماذا لو وجدت نفسك بأرضٍ أقصى ما يمكنك بلوغه بها هو خمسون عامًا .. ليست هذه القاعدة الوحيدة فحسب، بل هناك ما هو أكثر من ذلك',
                     'total_pages' => 318,
                     'type_id' => 1,
                 ],

                 [
                     'title' => 'إيكادولي',
                     'file' => 'books/files/إيكادولي.pdf',
                     'cover' => 'books/cover_images/إيكادولي.jpg',
                     'author_name' => 'حنان لاشين',
                     'points' => 10,
                     'description' => 'سعف النخيل يظلل الأفق من بعيد وكأنّه سحاب أخضر. صيحة غريبة صمّت أذنيه ثُمّ شعر فجأة بمخالب تقبض على كتفيه، فرفع بصره ورأى طائرًا عملاقًا يبسط جناحيه مظللًا فوق رأسه، تسارعت أنفاسه وهو يطير على ارتفاعٍ شاهق فوق وادٍ عميق يقطعه نهر ماؤه رقراق زمرّدي اللون! لاحت من بعيد أكواخٌ صغيرة لكنّها متقاربة مصفوفة بانتظام في مجاميع يفصل بينها ممرّات أرضها مغطاة بزهور صغيرة صفراء. تناهى إلى سمعه صوت أنثوي ناعم، كان يناديه ويكرر كلمة غريبة لم يدرك كنهها! "إيكادولي....إيكادولي".',
                     'total_pages' => 314,
                     'type_id' => 1,
                 ],

                 [
                     'title' => 'أماريتا',
                     'file' => 'books/files/أماريتا.pdf',
                     'cover' => 'books/cover_images/أماريتا.jpg',
                     'author_name' => 'عمرو عبد الحميد',
                     'points' => 0,
                     'description' => 'أماريتا أرض زيكولا 2
 لم أرَ من قبل خوف وجوه أهل زيكولا مثلما كنت أراه في تلك اللحظات أسفل أنوار المشاعل، زيكولا القوية التي تباهي أهلها دومًا بقوتها، باتوا عند أول اختبار حقيقي وجوهًا ذابلة مصدومة تخشى لحظاتها القادمة، أرض الرقص والاحتفالات لم تعد إلا أرض الخوف، أعلم أنهم يلعنون أسيل في داخلهم منذ تسربت إليهم الأخبار أنها سبب مايحدث لهم ، لكنهم قد تجاهلوا عمدًا أنهم من اقتنصوا ذكاءها كاملًا دون أن تضر واحدًا منهم يومًا ..',
                     'total_pages' => 328,
                     'type_id' => 1,
                 ],

                 //islamic
                 [
                     'title' => ' هذه رسالات القرآن فمن يتلقاها',
                     'file' => 'books/files/هذه رسالات القرآن فمن يتلقاها.pdf',
                     'cover' => 'books/cover_images/هذه رسالات القرآن فمن يتلقاها.jpg',
                     'author_name' => 'فريد الأنصاري',
                     'points' => 0,
                     'description' => 'ماذا لو وجدت نفسك بأرضٍ أقصى ما يمكنك بلوغه بها هو خمسون عامًا .. ليست هذه القاعدة الوحيدة فحسب، بل هناك ما هو أكثر من ذلك',
                     'total_pages' => 107,
                     'type_id' => 2,
                 ],





             ];

             foreach ($books as $book) {
                 Book::create($book);
             }
         }
     }*/
    }
}
